
// --*/


/=#

#langdef en-US "English"

//
// Processor Information
//
#string STR_PROCESSOR_SOCKET_DESIGNATION    #language en-US  "Hisilicon PhosphorV660 Processor"
#string STR_PROCESSOR_MANUFACTURE           #language en-US  "Huawei Technologies Co., Ltd."
#string STR_PROCESSOR_VERSION	            #language en-US  "A57 @ 2.1GHz"
#string STR_PROCESSOR_SERIAL_NUMBER         #language en-US  "To be filled by O.E.M."
#string STR_PROCESSOR_ASSET_TAG             #language en-US  "To be filled by O.E.M."
#string STR_PROCESSOR_PART_NUMBER           #language en-US  "To be filled by O.E.M."
#string STR_PROCESSOR_UNKNOWN               #language en-US  "Unknown"



